MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB202/mcu.h
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define RCON2 RCON2
extern volatile uint16_t RCON2 __attribute__((__sfr__));
typedef struct tagRCON2BITS {
  uint16_t VBAT:1;
  uint16_t VBPOR:1;
  uint16_t VDDPOR:1;
  uint16_t VDDBOR:1;
} RCON2BITS;
extern volatile RCON2BITS RCON2bits __attribute__((__sfr__));

#define HLVDCON HLVDCON
extern volatile uint16_t HLVDCON __attribute__((__sfr__));
__extension__ typedef struct tagHLVDCONBITS {
  union {
    struct {
      uint16_t HLVDL:4;
      uint16_t :1;
      uint16_t IRVST:1;
      uint16_t BGVST:1;
      uint16_t VDIR:1;
      uint16_t :5;
      uint16_t LSIDL:1;
      uint16_t :1;
      uint16_t HLVDEN:1;
    };
    struct {
      uint16_t HLVDL0:1;
      uint16_t HLVDL1:1;
      uint16_t HLVDL2:1;
      uint16_t HLVDL3:1;
      uint16_t :9;
      uint16_t HLSIDL:1;
    };
  };
} HLVDCONBITS;
extern volatile HLVDCONBITS HLVDCONbits __attribute__((__sfr__));

#define DSCON DSCON
extern volatile uint16_t DSCON __attribute__((__sfr__));
typedef struct tagDSCONBITS {
  uint16_t RELEASE:1;
  uint16_t DSBOR:1;
  uint16_t WAKEDIS:1;
  uint16_t :12;
  uint16_t DSEN:1;
} DSCONBITS;
extern volatile DSCONBITS DSCONbits __attribute__((__sfr__));

#define DSWAKE DSWAKE
extern volatile uint16_t DSWAKE __attribute__((__sfr__));
typedef struct tagDSWAKEBITS {
  uint16_t :2;
  uint16_t DSMCLR:1;
  uint16_t DSRTCC:1;
  uint16_t DSWDT:1;
  uint16_t :2;
  uint16_t DSFLT:1;
  uint16_t DSINT0:1;
} DSWAKEBITS;
extern volatile DSWAKEBITS DSWAKEbits __attribute__((__sfr__));

#define DSGPR0 DSGPR0
extern volatile uint16_t DSGPR0 __attribute__((__sfr__));
#define DSGPR1 DSGPR1
extern volatile uint16_t DSGPR1 __attribute__((__sfr__));
#define ALRMVAL ALRMVAL
extern volatile uint16_t ALRMVAL __attribute__((__sfr__));
#define ALCFGRPT ALCFGRPT
extern volatile uint16_t ALCFGRPT __attribute__((__sfr__));
__extension__ typedef struct tagALCFGRPTBITS {
  union {
    struct {
      uint16_t ARPT:8;
      uint16_t ALRMPTR:2;
      uint16_t AMASK:4;
      uint16_t CHIME:1;
      uint16_t ALRMEN:1;
    };
    struct {
      uint16_t ARPT0:1;
      uint16_t ARPT1:1;
      uint16_t ARPT2:1;
      uint16_t ARPT3:1;
      uint16_t ARPT4:1;
      uint16_t ARPT5:1;
      uint16_t ARPT6:1;
      uint16_t ARPT7:1;
      uint16_t ALRMPTR0:1;
      uint16_t ALRMPTR1:1;
      uint16_t AMASK0:1;
      uint16_t AMASK1:1;
      uint16_t AMASK2:1;
      uint16_t AMASK3:1;
    };
  };
} ALCFGRPTBITS;
extern volatile ALCFGRPTBITS ALCFGRPTbits __attribute__((__sfr__));

#define RTCVAL RTCVAL
extern volatile uint16_t RTCVAL __attribute__((__sfr__));
#define RCFGCAL RCFGCAL
extern volatile uint16_t RCFGCAL __attribute__((__sfr__));
__extension__ typedef struct tagRCFGCALBITS {
  union {
    struct {
      uint16_t CAL:8;
      uint16_t RTCPTR:2;
      uint16_t RTCOE:1;
      uint16_t HALFSEC:1;
      uint16_t RTCSYNC:1;
      uint16_t RTCWREN:1;
      uint16_t :1;
      uint16_t RTCEN:1;
    };
    struct {
      uint16_t CAL0:1;
      uint16_t CAL1:1;
      uint16_t CAL2:1;
      uint16_t CAL3:1;
      uint16_t CAL4:1;
      uint16_t CAL5:1;
      uint16_t CAL6:1;
      uint16_t CAL7:1;
      uint16_t RTCPTR0:1;
      uint16_t RTCPTR1:1;
    };
  };
} RCFGCALBITS;
extern volatile RCFGCALBITS RCFGCALbits __attribute__((__sfr__));

#define RTCPWC RTCPWC
extern volatile uint16_t RTCPWC __attribute__((__sfr__));
__extension__ typedef struct tagRTCPWCBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t RTCOUT:2;
      uint16_t RTCLK:2;
      uint16_t PWSPRE:1;
      uint16_t PWCPRE:1;
      uint16_t PWCPOL:1;
      uint16_t PWCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t RTCOUT0:1;
      uint16_t RTCOUT1:1;
      uint16_t RTCLK0:1;
      uint16_t RTCLK1:1;
      uint16_t PWCSPRE:1;
      uint16_t PWCCPRE:1;
    };
    struct {
      uint16_t :10;
      uint16_t RTCCLK:2;
    };
    struct {
      uint16_t :10;
      uint16_t RTCCLK0:1;
      uint16_t RTCCLK1:1;
    };
  };
} RTCPWCBITS;
extern volatile RTCPWCBITS RTCPWCbits __attribute__((__sfr__));

#define CRCCON1 CRCCON1
extern volatile uint16_t CRCCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON1BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t LENDIAN:1;
      uint16_t CRCGO:1;
      uint16_t CRCISEL:1;
      uint16_t CRCMPT:1;
      uint16_t CRCFUL:1;
      uint16_t VWORD:5;
      uint16_t CSIDL:1;
      uint16_t :1;
      uint16_t CRCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t VWORD0:1;
      uint16_t VWORD1:1;
      uint16_t VWORD2:1;
      uint16_t VWORD3:1;
      uint16_t VWORD4:1;
    };
  };
} CRCCON1BITS;
extern volatile CRCCON1BITS CRCCON1bits __attribute__((__sfr__));

#define CRCCON2 CRCCON2
extern volatile uint16_t CRCCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON2BITS {
  union {
    struct {
      uint16_t PLEN:5;
      uint16_t :3;
      uint16_t DWIDTH:5;
    };
    struct {
      uint16_t PLEN0:1;
      uint16_t PLEN1:1;
      uint16_t PLEN2:1;
      uint16_t PLEN3:1;
      uint16_t PLEN4:1;
      uint16_t :3;
      uint16_t DWIDTH0:1;
      uint16_t DWIDTH1:1;
      uint16_t DWIDTH2:1;
      uint16_t DWIDTH3:1;
      uint16_t DWIDTH4:1;
    };
  };
} CRCCON2BITS;
extern volatile CRCCON2BITS CRCCON2bits __attribute__((__sfr__));

#define CRCXORL CRCXORL
extern volatile uint16_t CRCXORL __attribute__((__sfr__));
typedef struct tagCRCXORLBITS {
  uint16_t :1;
  uint16_t X1:1;
  uint16_t X2:1;
  uint16_t X3:1;
  uint16_t X4:1;
  uint16_t X5:1;
  uint16_t X6:1;
  uint16_t X7:1;
  uint16_t X8:1;
  uint16_t X9:1;
  uint16_t X10:1;
  uint16_t X11:1;
  uint16_t X12:1;
  uint16_t X13:1;
  uint16_t X14:1;
  uint16_t X15:1;
} CRCXORLBITS;
extern volatile CRCXORLBITS CRCXORLbits __attribute__((__sfr__));

#define CRCXORH CRCXORH
extern volatile uint16_t CRCXORH __attribute__((__sfr__));
typedef struct tagCRCXORHBITS {
  uint16_t X16:1;
  uint16_t X17:1;
  uint16_t X18:1;
  uint16_t X19:1;
  uint16_t X20:1;
  uint16_t X21:1;
  uint16_t X22:1;
  uint16_t X23:1;
  uint16_t X24:1;
  uint16_t X25:1;
  uint16_t X26:1;
  uint16_t X27:1;
  uint16_t X28:1;
  uint16_t X29:1;
  uint16_t X30:1;
  uint16_t X31:1;
} CRCXORHBITS;
extern volatile CRCXORHBITS CRCXORHbits __attribute__((__sfr__));

#define CRCDAT CRCDAT
extern volatile uint16_t CRCDAT __attribute__((__sfr__));
#define CRCDATL CRCDATL
extern volatile uint16_t CRCDATL __attribute__((__sfr__));
#define CRCDATH CRCDATH
extern volatile uint16_t CRCDATH __attribute__((__sfr__));
#define CRCWDAT CRCWDAT
extern volatile uint16_t CRCWDAT __attribute__((__sfr__));
#define CRCWDATL CRCWDATL
extern volatile uint16_t CRCWDATL __attribute__((__sfr__));
#define CRCWDATH CRCWDATH
extern volatile uint16_t CRCWDATH __attribute__((__sfr__));
#define REFOCON1 REFOCON1
extern volatile uint16_t REFOCON1 __attribute__((__sfr__));
__extension__ typedef struct tagREFOCON1BITS {
  union {
    struct {
      uint16_t ROSEL:4;
      uint16_t :4;
      uint16_t ROACTIVE:1;
      uint16_t ROSWEN:1;
      uint16_t :1;
      uint16_t ROSLP:1;
      uint16_t ROOUT:1;
      uint16_t ROSIDL:1;
      uint16_t :1;
      uint16_t ROEN:1;
    };
    struct {
      uint16_t ROSEL0:1;
      uint16_t ROSEL1:1;
      uint16_t ROSEL2:1;
      uint16_t ROSEL3:1;
    };
  };
} REFOCON1BITS;
extern volatile REFOCON1BITS REFOCON1bits __attribute__((__sfr__));

#define REFOCONL REFOCONL
extern volatile uint16_t REFOCONL __attribute__((__sfr__));
__extension__ typedef struct tagREFOCONLBITS {
  union {
    struct {
      uint16_t ROSEL:4;
      uint16_t :4;
      uint16_t ROACTIVE:1;
      uint16_t ROSWEN:1;
      uint16_t :1;
      uint16_t ROSLP:1;
      uint16_t ROOUT:1;
      uint16_t ROSIDL:1;
      uint16_t :1;
      uint16_t ROEN:1;
    };
    struct {
      uint16_t ROSEL0:1;
      uint16_t ROSEL1:1;
      uint16_t ROSEL2:1;
      uint16_t ROSEL3:1;
    };
  };
} REFOCONLBITS;
extern volatile REFOCONLBITS REFOCONLbits __attribute__((__sfr__));

#define REFOCON2 REFOCON2
extern volatile uint16_t REFOCON2 __attribute__((__sfr__));
__extension__ typedef struct tagREFOCON2BITS {
  union {
    struct {
      uint16_t RODIV:15;
    };
    struct {
      uint16_t RODIV0:1;
      uint16_t RODIV1:1;
      uint16_t RODIV2:1;
      uint16_t RODIV3:1;
      uint16_t RODIV4:1;
      uint16_t RODIV5:1;
      uint16_t RODIV6:1;
      uint16_t RODIV7:1;
      uint16_t RODIV8:1;
      uint16_t RODIV9:1;
      uint16_t RODIV10:1;
      uint16_t RODIV11:1;
      uint16_t RODIV12:1;
      uint16_t RODIV13:1;
      uint16_t RODIV14:1;
    };
  };
} REFOCON2BITS;
extern volatile REFOCON2BITS REFOCON2bits __attribute__((__sfr__));

#define REFOCONH REFOCONH
extern volatile uint16_t REFOCONH __attribute__((__sfr__));
__extension__ typedef struct tagREFOCONHBITS {
  union {
    struct {
      uint16_t RODIV:15;
    };
    struct {
      uint16_t RODIV0:1;
      uint16_t RODIV1:1;
      uint16_t RODIV2:1;
      uint16_t RODIV3:1;
      uint16_t RODIV4:1;
      uint16_t RODIV5:1;
      uint16_t RODIV6:1;
      uint16_t RODIV7:1;
      uint16_t RODIV8:1;
      uint16_t RODIV9:1;
      uint16_t RODIV10:1;
      uint16_t RODIV11:1;
      uint16_t RODIV12:1;
      uint16_t RODIV13:1;
      uint16_t RODIV14:1;
    };
  };
} REFOCONHBITS;
extern volatile REFOCONHBITS REFOCONHbits __attribute__((__sfr__));

#define REFOTRIMH REFOTRIMH
extern volatile uint16_t REFOTRIMH __attribute__((__sfr__));
typedef struct tagREFOTRIMHBITS {
  uint16_t :7;
  uint16_t ROTRIM:9;
} REFOTRIMHBITS;
extern volatile REFOTRIMHBITS REFOTRIMHbits __attribute__((__sfr__));

