MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB202/mcu.h
extern volatile U1EP2BITS U1EP2bits __attribute__((__sfr__));

#define U1EP3 U1EP3
extern volatile uint16_t U1EP3 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP3BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP3BITS;
extern volatile U1EP3BITS U1EP3bits __attribute__((__sfr__));

#define U1EP4 U1EP4
extern volatile uint16_t U1EP4 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP4BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP4BITS;
extern volatile U1EP4BITS U1EP4bits __attribute__((__sfr__));

#define U1EP5 U1EP5
extern volatile uint16_t U1EP5 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP5BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP5BITS;
extern volatile U1EP5BITS U1EP5bits __attribute__((__sfr__));

#define U1EP6 U1EP6
extern volatile uint16_t U1EP6 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP6BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP6BITS;
extern volatile U1EP6BITS U1EP6bits __attribute__((__sfr__));

#define U1EP7 U1EP7
extern volatile uint16_t U1EP7 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP7BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP7BITS;
extern volatile U1EP7BITS U1EP7bits __attribute__((__sfr__));

#define U1EP8 U1EP8
extern volatile uint16_t U1EP8 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP8BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP8BITS;
extern volatile U1EP8BITS U1EP8bits __attribute__((__sfr__));

#define U1EP9 U1EP9
extern volatile uint16_t U1EP9 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP9BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP9BITS;
extern volatile U1EP9BITS U1EP9bits __attribute__((__sfr__));

#define U1EP10 U1EP10
extern volatile uint16_t U1EP10 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP10BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP10BITS;
extern volatile U1EP10BITS U1EP10bits __attribute__((__sfr__));

#define U1EP11 U1EP11
extern volatile uint16_t U1EP11 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP11BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP11BITS;
extern volatile U1EP11BITS U1EP11bits __attribute__((__sfr__));

#define U1EP12 U1EP12
extern volatile uint16_t U1EP12 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP12BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP12BITS;
extern volatile U1EP12BITS U1EP12bits __attribute__((__sfr__));

#define U1EP13 U1EP13
extern volatile uint16_t U1EP13 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP13BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP13BITS;
extern volatile U1EP13BITS U1EP13bits __attribute__((__sfr__));

#define U1EP14 U1EP14
extern volatile uint16_t U1EP14 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP14BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP14BITS;
extern volatile U1EP14BITS U1EP14bits __attribute__((__sfr__));

#define U1EP15 U1EP15
extern volatile uint16_t U1EP15 __attribute__((__sfr__));
__extension__ typedef struct tagU1EP15BITS {
  union {
    struct {
      uint16_t EPHSHK:1;
      uint16_t EPSTALL:1;
      uint16_t EPTXEN:1;
      uint16_t EPRXEN:1;
      uint16_t EPCONDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t EPINEN:1;
      uint16_t EPOUTEN:1;
    };
  };
} U1EP15BITS;
extern volatile U1EP15BITS U1EP15bits __attribute__((__sfr__));

#define DMACON DMACON
extern volatile uint16_t DMACON __attribute__((__sfr__));
typedef struct tagDMACONBITS {
  uint16_t PRSSEL:1;
  uint16_t :14;
  uint16_t DMAEN:1;
} DMACONBITS;
extern volatile DMACONBITS DMACONbits __attribute__((__sfr__));

#define DMABUF DMABUF
extern volatile uint16_t DMABUF __attribute__((__sfr__));
#define DMAL DMAL
extern volatile uint16_t DMAL __attribute__((__sfr__));
#define DMAH DMAH
extern volatile uint16_t DMAH __attribute__((__sfr__));
#define DMACH0 DMACH0
extern volatile uint16_t DMACH0 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH0BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH0BITS;
