MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB202/mcu.h
#define _CRYCON1_CRYON_POSITION                  0x0000000F
#define _CRYCON1_CRYON_MASK                      0x00008000
#define _CRYCON1_CRYON_LENGTH                    0x00000001

#define _CRYCON1_CPHRMOD0_POSITION               0x00000000
#define _CRYCON1_CPHRMOD0_MASK                   0x00000001
#define _CRYCON1_CPHRMOD0_LENGTH                 0x00000001

#define _CRYCON1_CPHRMOD1_POSITION               0x00000001
#define _CRYCON1_CPHRMOD1_MASK                   0x00000002
#define _CRYCON1_CPHRMOD1_LENGTH                 0x00000001

#define _CRYCON1_CPHRMOD2_POSITION               0x00000002
#define _CRYCON1_CPHRMOD2_MASK                   0x00000004
#define _CRYCON1_CPHRMOD2_LENGTH                 0x00000001

#define _CRYCON1_OPMOD0_POSITION                 0x00000004
#define _CRYCON1_OPMOD0_MASK                     0x00000010
#define _CRYCON1_OPMOD0_LENGTH                   0x00000001

#define _CRYCON1_OPMOD1_POSITION                 0x00000005
#define _CRYCON1_OPMOD1_MASK                     0x00000020
#define _CRYCON1_OPMOD1_LENGTH                   0x00000001

#define _CRYCON1_OPMOD2_POSITION                 0x00000006
#define _CRYCON1_OPMOD2_MASK                     0x00000040
#define _CRYCON1_OPMOD2_LENGTH                   0x00000001

#define _CRYCON1_OPMOD3_POSITION                 0x00000007
#define _CRYCON1_OPMOD3_MASK                     0x00000080
#define _CRYCON1_OPMOD3_LENGTH                   0x00000001

#define _CRYCONL_CPHRMOD_POSITION                0x00000000
#define _CRYCONL_CPHRMOD_MASK                    0x00000007
#define _CRYCONL_CPHRMOD_LENGTH                  0x00000003

#define _CRYCONL_CPHRSEL_POSITION                0x00000003
#define _CRYCONL_CPHRSEL_MASK                    0x00000008
#define _CRYCONL_CPHRSEL_LENGTH                  0x00000001

#define _CRYCONL_OPMOD_POSITION                  0x00000004
#define _CRYCONL_OPMOD_MASK                      0x000000F0
#define _CRYCONL_OPMOD_LENGTH                    0x00000004

#define _CRYCONL_CRYGO_POSITION                  0x00000008
#define _CRYCONL_CRYGO_MASK                      0x00000100
#define _CRYCONL_CRYGO_LENGTH                    0x00000001

#define _CRYCONL_FREEIE_POSITION                 0x0000000A
#define _CRYCONL_FREEIE_MASK                     0x00000400
#define _CRYCONL_FREEIE_LENGTH                   0x00000001

#define _CRYCONL_DONEIE_POSITION                 0x0000000B
#define _CRYCONL_DONEIE_MASK                     0x00000800
#define _CRYCONL_DONEIE_LENGTH                   0x00000001

#define _CRYCONL_ROLLIE_POSITION                 0x0000000C
#define _CRYCONL_ROLLIE_MASK                     0x00001000
#define _CRYCONL_ROLLIE_LENGTH                   0x00000001

#define _CRYCONL_CRYSIDL_POSITION                0x0000000D
#define _CRYCONL_CRYSIDL_MASK                    0x00002000
#define _CRYCONL_CRYSIDL_LENGTH                  0x00000001

#define _CRYCONL_CRYON_POSITION                  0x0000000F
#define _CRYCONL_CRYON_MASK                      0x00008000
#define _CRYCONL_CRYON_LENGTH                    0x00000001

#define _CRYCONL_CPHRMOD0_POSITION               0x00000000
#define _CRYCONL_CPHRMOD0_MASK                   0x00000001
#define _CRYCONL_CPHRMOD0_LENGTH                 0x00000001

#define _CRYCONL_CPHRMOD1_POSITION               0x00000001
#define _CRYCONL_CPHRMOD1_MASK                   0x00000002
#define _CRYCONL_CPHRMOD1_LENGTH                 0x00000001

#define _CRYCONL_CPHRMOD2_POSITION               0x00000002
#define _CRYCONL_CPHRMOD2_MASK                   0x00000004
#define _CRYCONL_CPHRMOD2_LENGTH                 0x00000001

#define _CRYCONL_OPMOD0_POSITION                 0x00000004
#define _CRYCONL_OPMOD0_MASK                     0x00000010
#define _CRYCONL_OPMOD0_LENGTH                   0x00000001

#define _CRYCONL_OPMOD1_POSITION                 0x00000005
#define _CRYCONL_OPMOD1_MASK                     0x00000020
#define _CRYCONL_OPMOD1_LENGTH                   0x00000001

#define _CRYCONL_OPMOD2_POSITION                 0x00000006
#define _CRYCONL_OPMOD2_MASK                     0x00000040
#define _CRYCONL_OPMOD2_LENGTH                   0x00000001

#define _CRYCONL_OPMOD3_POSITION                 0x00000007
#define _CRYCONL_OPMOD3_MASK                     0x00000080
#define _CRYCONL_OPMOD3_LENGTH                   0x00000001

#define _CRYCON2_KEYSRC_POSITION                 0x00000000
#define _CRYCON2_KEYSRC_MASK                     0x0000000F
#define _CRYCON2_KEYSRC_LENGTH                   0x00000004

#define _CRYCON2_KEYMOD_POSITION                 0x00000005
#define _CRYCON2_KEYMOD_MASK                     0x00000060
#define _CRYCON2_KEYMOD_LENGTH                   0x00000002

#define _CRYCON2_SKEYSEL_POSITION                0x00000007
#define _CRYCON2_SKEYSEL_MASK                    0x00000080
#define _CRYCON2_SKEYSEL_LENGTH                  0x00000001

#define _CRYCON2_CTRSIZE_POSITION                0x00000008
#define _CRYCON2_CTRSIZE_MASK                    0x00007F00
#define _CRYCON2_CTRSIZE_LENGTH                  0x00000007

#define _CRYCON2_KEYSRC0_POSITION                0x00000000
#define _CRYCON2_KEYSRC0_MASK                    0x00000001
#define _CRYCON2_KEYSRC0_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC1_POSITION                0x00000001
#define _CRYCON2_KEYSRC1_MASK                    0x00000002
#define _CRYCON2_KEYSRC1_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC2_POSITION                0x00000002
#define _CRYCON2_KEYSRC2_MASK                    0x00000004
#define _CRYCON2_KEYSRC2_LENGTH                  0x00000001

#define _CRYCON2_KEYSRC3_POSITION                0x00000003
#define _CRYCON2_KEYSRC3_MASK                    0x00000008
#define _CRYCON2_KEYSRC3_LENGTH                  0x00000001

#define _CRYCON2_KEYMOD0_POSITION                0x00000005
#define _CRYCON2_KEYMOD0_MASK                    0x00000020
#define _CRYCON2_KEYMOD0_LENGTH                  0x00000001

#define _CRYCON2_KEYMOD1_POSITION                0x00000006
#define _CRYCON2_KEYMOD1_MASK                    0x00000040
#define _CRYCON2_KEYMOD1_LENGTH                  0x00000001

